test/Artillery.yml
config:
  target: "http://127.0.0.1:10000"
  phases:
    - duration: 60        
      arrivalRate: 5      
      rampTo: 20          
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Load Test for Local Server"
    flow:
      - get:
          url: "/api/cats"

      - post:
          url: "/api/cats"  
          json:
            Name: "value1"
            Age: 1
            Size: 12.0
            Color: "value2"