test/Artillery2.yml
config:
  target: http://127.0.0.1:10000/api
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
scenarios:
  - flow:
      - loop:
          - get:
              url: '/users'
              headers:
                Key: ABC123
        count: 100